#+TITLE: Land of Lisp
#+TAGS: cannot beyond important
*** 普通に作ると名前が必要
#+BEGIN_SRC elisp
  (defun half (n)
    (/ n 2))

  (half 6)
#+END_SRC

#+RESULTS:
: 3
*** lambdaを使うと名前もdefunもいらない
#+BEGIN_SRC elisp
  ((lambda (n) (/ n 2)) 10)
#+END_SRC

#+RESULTS:
: 4
*** mapcarに渡して使う
#+BEGIN_SRC elisp
  (mapcar (lambda (n) (/ n 2)) '(2 4 6))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |
****** 関数を使ってみる
長さが3のリストを渡すと，ちゃんと3と返ってきた．

#+BEGIN_SRC elisp
  (my-length '(fie foh fum))
#+END_SRC
#+RESULTS:
: 3

****** 末尾呼び出しバージョンを使ってみる
この環境じゃ違いがわからないけど...
#+BEGIN_SRC elisp
  (my-length '(fie foh fum))
#+END_SRC

#+RESULTS:
: 3

** もっと複雑なマクロ
冗長だった[[*my-length][my-length]]関数を，マクロを使って書き直す
my-lengthを再掲し，冗長なポイントにコメントをつけてみた．
#+BEGIN_SRC elisp
  (defun my-length (lst)
    (labels ((f (lst acc)                 ;ローカル関数を定義する
                (if lst                   ;リストが空かどうか調べる
                    (f (cdr lst) (1+ acc)) ;cdrでリストの残りを調べる
                  acc)))
      (f lst 0)))

  (my-length '(foo bar ping pong))
#+END_SRC

#+RESULTS:
: 4
マクロを使って，my-lengthを引き締めよう．
